/* ***********************************************************************************************
* 
* Mac OS X EMBEDDED
* Localizable Strings
*
 *********************************************************************************************** */


/* Alert  strings */
"OK" = "OK";
"Cancel" = "Avbryt";
"Disconnect" = "Koppla från";

"Settings" = "Inställningar";
"Ignore" = "Ignorera";

/* Notification window title */
"Network Connection" = "Nätverksanslutning";
"VPN Connection" = "VPN-anslutning";

/* Misc messages */
"Waiting for disconnection" = "Väntar på att PPP ska avslutas…";

/*  
    PPP error strings
    
    PPP will display one of the following LastCause published in the service/state
    of the PPP dictionnary.
    PPP errors contain a PPP generic part in the key "LastCause".
    and a Device specific part in the key "DeviceLastCause".
    
    The Device specific part is there to give more details of the PPP error.
    For example, for a PPP Error 8, meaning that the connection has failed, 
    we can have a Device Error detailing the failure cause, like Busy, NoDialTone...
    
    Therefore, if the device specific part is not 0, 
    PPP will display the device error message, that is defained in the bundle of the 
    corresponding PPP subtype (for example PPPSerial.ppp).
    If the Device specific part is 0, then PPP will display the PPP message.
    Device error must be formatted "Device Error %d".
    
    Device errors start from 1. PPP Error start from 0.
    If the text for the error does not exist, the error number will be displayed.
    If the text for the error exist but is empty, nothing will be displayed 
	PPP Error 5 is normal exit error and is special case in the code.  
*/

"PPP Error 0" = "Du kopplades ned av PPP-servern. Försök ansluta igen.";
"PPP Error 1" = "Anslutningen misslyckades på grund av ett oåterkalleligt fel. Försök ansluta igen. Om problemet kvarstår kontrollerar du dina inställningar och kontaktar administratören.";
"PPP Error 2" = "Anslutningen misslyckades på grund av en felaktig PPP-inställning. Kontrollera dina inställningar och försök ansluta igen.";
"PPP Error 3" = "PPP har inte tillräckliga behörigheter för att fungera.";
"PPP Error 4" = "Kunde inte hitta kärntillägget för PPP.";
/* "PPP Error 5" = ""; */ /* normal exit, nothing to display. this is special case in the code */
"PPP Error 6" = "Låsning misslyckades"; /* not supported */
"PPP Error 7" = "Anslutningen misslyckades eftersom kommunikationsenheten inte är tillgänglig. Kontrollera att den är ansluten till datorn och försök sedan ansluta igen.";
"PPP Error 8" = "Anslutningen misslyckades. Försök ansluta igen. Om problemet kvarstår kontrollerar du dina inställningar och kontaktar administratören.";
"PPP Error 9" = "Terminalanslutningen misslyckades. Kontrollera dina inställningar och försök ansluta igen."; /* not supported */
"PPP Error 10" = "Kunde inte etablera en anslutning med PPP-servern. Försök ansluta igen. Om problemet kvarstår kontrollerar du dina inställningar och kontaktar administratören.";
"PPP Error 11" = "PPP-servern kunde inte autentiseras"; /* not supported */
"PPP Error 12" = "Du kopplades ned eftersom det inte fanns någon nätverksaktivitet.";
"PPP Error 13" = "Du kopplades ned eftersom tidsgränsen uppnåddes.";
"PPP Error 14" = "Återuppringning misslyckades"; /* not supported */
"PPP Error 15" = "Du kopplades ned eftersom PPP-servern inte svarar. Försök ansluta igen.";
"PPP Error 16" = "Du kopplades ned av kommunikationsenheten. Försök ansluta igen. Om problemet kvarstår kontrollerar du dina inställningar.";
"PPP Error 17" = "En korsad anslutning upptäcktes. Kontrollera dina inställningar och försök ansluta igen.";
"PPP Error 18" = "Det gick inte att initiera PPP";
"PPP Error 19" = "Autentiseringen misslyckades.";
"PPP Error 20" = "Terminalskriptet misslyckades. Kontrollera dina inställningar och försök ansluta igen.";
"PPP Error 21" = "Kommunikationsenheten som valts för anslutningen finns inte. Kontrollera dina inställningar och försök ansluta igen.";
"PPP Error 22" = "Du kopplades ned eftersom du har överfört den maximala mängden data.";
"PPP Error 23" = "Användaren har inte behörighet att ansluta.";
"PPP Error 24" = "Fjärrnumret har inte tillåtelse att ansluta. Kontrollera dina inställningar och försök igen.";
"PPP Error 25" = "Servern kan inte nås. Försök ansluta igen. Om problemet kvarstår kontrollerar du dina inställningar och kontaktar administratören.";
"PPP Error 127" = "Du kopplades ned. Försök ansluta igen. Om problemet kvarstår kontrollerar du dina inställningar och kontaktar administratören.";

/* 
	PPP Device errors
	The following errors are PPP Link specific. 
	When returned by the link, they provide more accurate error than the generic PPP error.
*/

"L2TP Error 1" = "L2TP-VPN-servern kunde inte nås. Kontrollera serveradressen och försök ansluta igen. Om problemet kvarstår kontaktar du administratören.";
"L2TP Error 2" = "L2TP-VPN-servern svarade inte. Försök ansluta igen. Om problemet kvarstår kontrollerar du dina inställningar och kontaktar administratören.";
"L2TP Error 5" = "Försöket att nå L2TP-VPN-servern misslyckades. Försök ansluta igen. Om problemet kvarstår kontrollerar du dina inställningar och kontaktar administratören.";
/* From HI guidelines: we should never show the disconnection errors below */
"L2TP Error 6" = ""; /* "You have been disconnected from the L2TP server because the network configuration changed."; */
"L2TP Error 7" = "Den delade IPSec-hemligheten saknas. Kontrollera dina inställningar och försök igen.";
"L2TP Error 8" = "IPSec-certifikatet saknas. Kontrollera dina inställningar och försök ansluta igen.";
"L2TP Error 9" = "Ingen tillgänglig nätverksanslutning."; /* EDGE connection failed */


"PPTP Error 1" = "PPTP-VPN-servern kunde inte nås. Kontrollera serveradressen och försök ansluta igen. Om problemet kvarstår kontaktar du administratören.";
"PPTP Error 2" = "PPTP-VPN-servern svarade inte. Försök ansluta igen. Om problemet kvarstår kontrollerar du dina inställningar och kontaktar administratören.";
"PPTP Error 5" = "Försöket att nå PPTP-VPN-servern misslyckades. Försök ansluta igen. Om problemet kvarstår kontrollerar du dina inställningar och kontaktar administratören.";
/* From HI guidelines: we should never show the disconnection errors below */
"PPTP Error 6" = ""; /* "You have been disconnected from the PPTP server because the network configuration changed."; */
"PPTP Error 7" = "Ingen tillgänglig nätverksanslutning."; /* EDGE connection failed */



/*  
    IPSec error strings
    
    IPSec will display one of the following errors.
*/

/* "IPSec Error 0" = ""; */ /* no error */
"IPSec Error 1" = "Ett oväntat fel inträffade."; /* Generic error */
"IPSec Error 2" = "Ingen VPN-serveradress har angetts."; /* No Server Address error */
"IPSec Error 3" = "Ingen delad hemlighet för VPN har angetts."; /* No Shared Secret error */
"IPSec Error 4" = "Inget VPN-certifikat har angetts."; /* No Certificate error */
"IPSec Error 5" = "VPN-servern kunde inte hittas."; /* Server Address did not resolve error */
"IPSec Error 6" = "Ingen tillgänglig nätverksanslutning."; /* No Local Network error */
"IPSec Error 7" = "Ett konfigurationsfel uppstod."; /* Configuration error */
"IPSec Error 8" = "Ett oåterkalleligt fel inträffade."; /* Racoon Control error */
"IPSec Error 9" = "VPN-servern svarade inte."; /* Connection error */
"IPSec Error 10" = "Förhandlingen med VPN-servern misslyckades."; /* Negotiation error */
"IPSec Error 11" = "Den delade hemligheten för VPN är felaktig."; /* Invalid Shared Secret error */
"IPSec Error 12" = "Servercertifikatet kunde inte bekräftas."; /* Certificate authentication error */
"IPSec Error 13" = "Certifikatautentiseringen misslyckades."; /* Certificate authentication error */
"IPSec Error 13, Re-enroll" = "Certifikatautentiseringen misslyckades. Kontakta nätverksadministratören eller försök registrera igen i Inställningar."; /* Certificate authentication error with Fix Me button */
"IPSec Error 14" = "Användarautentiseringen misslyckades."; /* XAUTH User Authentication error */
/* From HI guidelines: we should never show the disconnection errors below */
"IPSec Error 15" = ""; /* "You have been disconnected from the VPN server because the network configuration changed."; */ /* Network changed error */
"IPSec Error 16" = ""; /* "The connection was terminated by the VPN server. Try reconnecting."; */ /* Peer Disconnection error */
"IPSec Error 17" = ""; /* "The connection was terminated because the VPN server is not responding. Try reconnecting."; */ /* Peer Dead Detection error */
"IPSec Error 18" = "Ingen tillgänglig nätverksanslutning."; /* EDGE connection failed */
"IPSec Error 19" = ""; /* "You were disconnected because there was no network activity."; */ /* Idle Timeout error */
"IPSec Error 20" = "Certifikatet är inte giltigt ännu."; /* Client Certificate date not yet valid */
"IPSec Error 20, Re-enroll" = "Certifikatet är inte giltigt ännu. Kontakta nätverksadministratören eller försök registrera igen i Inställningar."; /* Client Certificate date not yet valid */
"IPSec Error 21" = "Certifikatet har förfallit."; /* Certificate expired error */
"IPSec Error 21, Re-enroll" = "Certifikatet har förfallit. Kontakta nätverksadministratören eller försök registrera igen i Inställningar."; /* Certificate expired error with Fix Me button */
"IPSec Error 22" = "Servercertifikatet är inte giltigt ännu. Kontakta nätverksadministratören."; /* Server Certificate date not yet valid */
"IPSec Error 23" = "Servercertifikatet har förfallit. Kontakta nätverksadministratören."; /* Server Certificate expiry error */
"IPSec Error 24" = "Servercertifikatets identitet är felaktig. Kontakta nätverksadministratören."; /* Server Certificate ID mismatched or unexpected */

/* 
	IPSec XAuth strings
	Ipsec will use those strings in the User Authentication dialogs
*/ 
"Enter your user authentication" = "Ange användarautentisering";
"Enter Username and Password." = "Ange användarautentisering";
"Answer" = "Svara";
"Next PIN" = "Nästa PIN-kod";
"Account" = "Konto";
"Passcode" = "Lösenkod";
"Password" = "Lösenord";


/*  
    VPN error strings
    
    VPN will display one of the following errors.
*/

/* "VPN Error 0" = ""; */ /* no error */
"VPN Error 1" = "Ett oväntat fel inträffade."; /* Generic error */
"VPN Error 2" = "Ingen VPN-serveradress har angetts."; /* No Server Address error */
"VPN Error 3" = "Inget VPN-certifikat har angetts."; /* No Certificate error */
"VPN Error 4" = "VPN-servern kunde inte hittas."; /* Server Address did not resolve error */
"VPN Error 5" = "Ingen tillgänglig nätverksanslutning."; /* No Local Network error */
"VPN Error 6" = "Ett konfigurationsfel uppstod."; /* Configuration error */
"VPN Error 7" = "Ett oåterkalleligt fel inträffade."; /* Control error */
"VPN Error 8" = "VPN-servern svarade inte."; /* Connection error */

/* From HI guidelines: we should never show the disconnection errors below */
"VPN Error 9" = ""; /* "You have been disconnected from the VPN server because the network configuration changed."; */ /* Network changed error */
"VPN Error 10" = ""; /* "The connection was terminated by the VPN server. Try reconnecting."; */ /* Peer Disconnection error */
"VPN Error 11" = ""; /* "The connection was terminated because the VPN server is not responding. Try reconnecting."; */ /* Peer Dead Detection error */
"VPN Error 12" = ""; /* "The connection was terminated because the VPN server is not responding. Try reconnecting."; */ /* Peer Dead Detection error */
"VPN Error 13" = ""; /* negotiation error */
"VPN Error 14" = "Användarautentiseringen misslyckades."; /* XAUTH User Authentication error */
"VPN Error 15" = "Ingen tillgänglig nätverksanslutning."; /* EDGE connection failed */
"VPN Error 16" = ""; /* "You were disconnected because there was no network activity."; */ /* Idle Timeout error */
"VPN Error 17" = "Ogiltig serveradress."; /* "You were disconnected because there was no network activity."; */ /* Idle Timeout error */
"VPN Error 18" = "VPN-anslutningen kräver att ett program startas."; /* "The VPN connection requires an application to start up."; */ /* Application required error */
"VPN Error 20" = "Certifikatet är inte giltigt ännu."; /* Client Certificate date not yet valid */
"VPN Error 20, Re-enroll" = "Certifikatet är inte giltigt ännu. Kontakta nätverksadministratören eller försök registrera igen i Inställningar."; /* Client Certificate date not yet valid */
"VPN Error 21" = "Certifikatet har förfallit."; /* Certificate expired error */
"VPN Error 21, Re-enroll" = "Certifikatet har förfallit. Kontakta nätverksadministratören eller försök registrera igen i Inställningar."; /* Certificate expired error with Fix Me button */
"VPN Error 22" = "Servercertifikatet är inte giltigt ännu. Kontakta nätverksadministratören."; /* Server Certificate date not yet valid */
"VPN Error 23" = "Servercertifikatet har förfallit. Kontakta nätverksadministratören."; /* Server Certificate expiry error */
"VPN Error 24" = "Servercertifikatets identitet är felaktig. Kontakta nätverksadministratören."; /* Server Certificate ID mismatched or unexpected */
"VPN Error 25" = "";																	/* Plugin Update */
"VPN Error 26" = "VPN-anslutningen aktiveras när programmet öppnas.";			/* plugin needs to be enabled */
